#Выполняю таск 3.5
visitors = ['Женя', 'Кристина', 'Данька']
print("Дорогой "+visitors[0]+"! Обязательно приходи сегодня на обед. Мероприятие обещает быть веселым!")
print("Дорогая "+visitors[1]+"! Обязательно приходи сегодня на обед. Мероприятие обещает быть веселым!")
print("Дорогой "+visitors[2]+"! Обязательно приходи сегодня на обед. Мероприятие обещает быть веселым!")

print(visitors[2]+" не сможет явится на мероприятие.")
visitors[2] = 'Руслан'
print("Дорогой "+visitors[0]+"! Обязательно приходи сегодня на обед. Мероприятие обещает быть веселым!")
print("Дорогая "+visitors[1]+"! Обязательно приходи сегодня на обед. Мероприятие обещает быть веселым!")
print("Дорогой "+visitors[2]+"! Обязательно приходи сегодня на обед. Мероприятие обещает быть веселым!")
