#Выполняю таск 3.6
visitors = ['Женя', 'Кристина', 'Данька']

print("Дополнительные места позволяют пригласить на обед еще трех гостей.")

visitors.insert(0, 'Руслан')
visitors.insert(2, 'Дима')
visitors.append('Ира')

print("Дорогой "+visitors[0]+"! Обязательно приходи сегодня на обед. Мероприятие обещает быть веселым!")
print("Дорогая "+visitors[1]+"! Обязательно приходи сегодня на обед. Мероприятие обещает быть веселым!")
print("Дорогой "+visitors[2]+"! Обязательно приходи сегодня на обед. Мероприятие обещает быть веселым!")
print("Дорогая "+visitors[3]+"! Обязательно приходи сегодня на обед. Мероприятие обещает быть веселым!")
print("Дорогой "+visitors[4]+"! Обязательно приходи сегодня на обед. Мероприятие обещает быть веселым!")
print("Дорогая "+visitors[5]+"! Обязательно приходи сегодня на обед. Мероприятие обещает быть веселым!")
