#Создайте список трех своих любимых фруктов и назовите его favorite_fruits.
favorite_fruits = ['груша', 'яблоко', 'виноград']
#Напишите пять команд if. Каждая команда должна проверять, входит ли определенный 
#тип фрукта в список. Если фрукт входит в список, блок if должен выводить 
#сообщение вида «You really like bananas!».
if 'груша' in favorite_fruits:
    print("Ты действительно любишь грушу!")
if 'яблоко' in favorite_fruits:
    print("Ты действительно любишь яблоки!")
if 'виноград' in favorite_fruits:
    print("Ты действительно любишь виноград!")
if 'земляника' in favorite_fruits:
    print("Ты действительно любишь землянику")
if 'банан' in favorite_fruits:
    print("Ты действительно любишь бананы!")