#Вывести цитату
print('Илон Маск однажды сказал, "Ошибки совершать не страшно. Главное каждый раз ошибаться в чем-то новом."')